import pytest
import src.views as views


@pytest.mark.parametrize(
    "value, expected",
    [
        (
            [
                {"Номер карты": "**1234", "Сумма операции": "-500", "Кэшбэк": 70},
                {"Номер карты": "**5533", "Сумма операции": "500"},
                {"Номер карты": "**1234", "Сумма операции": "-100", "Кэшбэк": 20},
                {"Номер карты": "**5533", "Сумма операции": "720", "Кэшбэк": 10},
                {"Номер карты": "**6251", "Сумма операции": "-700", "Кэшбэк": 150},
                {"Номер карты": "**1234", "Сумма операции": " 200", "Кэшбэк": 70},
                {"Номер карты": "**6251", "Сумма операции": "-1000"},
                {"Номер карты": "**1234", "Сумма операции": "-30", "Кэшбэк": 70},
            ],
            [
                {"last_digits": "1234", "total_spent": 630.0, "cashback": 2},
                {"last_digits": "5533", "total_spent": 0.0, "cashback": 0},
                {"last_digits": "6251", "total_spent": 1700.0, "cashback": 1},
            ]
        )
    ],
)


def test_cards_collector(value: list, expected: list) -> None:
    assert views.cards_collector(value) == expected


@pytest.mark.parametrize(
    "value, expected",
    [
        (
            [
                {"Дата платежа": "01.02.2020", "Сумма платежа": "-500", "Категория": "Переводы", "Описание": "Дмитрий Ш."},
                {"Дата платежа": "01.01.2019", "Сумма платежа": "500", "Категория": "Переводы", "Описание": "Василий П."},
                {"Дата платежа": "21.12.2024", "Сумма платежа": "-1500", "Категория": "Супермаркеты", "Описание": "Пятерочка"},
                {"Дата платежа": "21.12.2020", "Сумма платежа": "-500", "Категория": "Фастфуд", "Описание": "Вкусно и точка"},
                {"Дата платежа": "21.12.2024", "Сумма платежа": "-500", "Категория": "Развлечения", "Описание": "Steam"},
                {"Дата платежа": "10.03.2022", "Сумма платежа": "-2500", "Категория": "Заправки", "Описание": "Роснефть №152"},
                {"Дата платежа": "24.02.2022", "Сумма платежа": "-500", "Категория": "Переводы", "Описание": "Ирина Л."},
                {"Дата платежа": "25.02.2024", "Сумма платежа": "600", "Категория": "Переводы", "Описание": "Петр Р."},
            ],
            [
                    {"Дата платежа": "25.02.2024", "Сумма платежа": "600", "Категория": "Переводы", "Описание": "Петр Р."},
                    {"Дата платежа": "01.01.2019", "Сумма платежа": "500", "Категория": "Переводы", "Описание": "Василий П."},
                    {"Дата платежа": "21.12.2024", "Сумма платежа": "-500", "Категория": "Развлечения", "Описание": "Steam"},
                    {"Дата платежа": "24.02.2022", "Сумма платежа": "-500", "Категория": "Переводы", "Описание": "Ирина Л."},
                    {"Дата платежа": "21.12.2020", "Сумма платежа": "-500", "Категория": "Фастфуд", "Описание": "Вкусно и точка"}
            ]
        )
    ],
)

def test_top_transactions(value: list, expected: list) -> None:
    assert views.top_transactions(value) == expected
