import json

import pandas as pd
import pytest

import src.services as services


@pytest.mark.parametrize(
    "value, expected",
    [
        (
            [
                {"Дата операции": "02.12.2021 14:41:17", "Категория": "Продукты", "Кэшбэк": 70},
                {"Дата операции": "01.12.2021 23:40:34", "Категория": "Топливо", "Кэшбэк": 150},
                {"Дата операции": "01.12.2021 18:50:24", "Категория": "Транспорт"},
                {"Дата операции": "01.12.2021 13:12:18", "Категория": "Развлечения", "Кэшбэк": 5},
                {"Дата операции": "30.11.2021 18:19:28", "Категория": "Продукты", "Кэшбэк": 10},
                {"Дата операции": "29.11.2021 14:40:46", "Категория": "Развлечения", "Кэшбэк": 5},
                {"Дата операции": "25.11.2021 20:47:27", "Категория": "Продукты", "Кэшбэк": 5},
                {"Дата операции": "25.11.2021 19:02:06", "Категория": "Развлечения", "Кэшбэк": 10},
                {"Дата операции": "09.11.2021 18:45:24", "Категория": "Топливо", "Кэшбэк": 100},
                {"Дата операции": "07.11.2021 18:50:25", "Категория": "Транспорт"},
                {"Дата операции": "28.10.2021 15:51:42", "Категория": "Транспорт"},
            ],
            {"Топливо": 100, "Продукты": 15, "Развлечения": 15},
        )
    ],
)
def test_cashback_category(value, expected):
    assert json.loads(services.cashback_category(pd.DataFrame(value), 2021, 11)) == expected
