import pytest
import src.utils as utils


@pytest.mark.parametrize(
    "value, expected",
    [
        (
            [
                {"Номер карты": "**1234", "Сумма операции": "-500", "Кэшбэк": 70},
                {"Номер карты": "**5533", "Сумма операции": "500"},
                {"Номер карты": "**1234", "Сумма операции": "-100", "Кэшбэк": 20},
                {"Номер карты": "**5533", "Сумма операции": "720", "Кэшбэк": 10},
                {"Номер карты": "**6251", "Сумма операции": "-700", "Кэшбэк": 150},
                {"Номер карты": "**1234", "Сумма операции": " 200", "Кэшбэк": 70},
                {"Номер карты": "**6251", "Сумма операции": "-1000"},
                {"Номер карты": "**1234", "Сумма операции": "-30", "Кэшбэк": 70},
            ],
            {
                "cards": {
                    '1234': {"last_digits": "1234", "total_spent": 630.0, "cashback": 2},
                    '5533': {"last_digits": "5533", "total_spent": 0.0, "cashback": 0},
                    '6251': {"last_digits": "6251", "total_spent": 1700.0, "cashback": 1},
                }
            },
        )
    ],
)


def test_cards_collector(value: list, expected: list) -> None:
    assert utils.cards_collector(value) == expected